/************************************************************************************/
//模块名称：GSLB二期,共用结构体定义
//功能说明：1)结构体
//作者：徐永丰 tianya0513@hotmail.com
//日期：2008-9-1
//Copyright (C), 2008-2010 Dnion Tech. Co., Ltd.
/************************************************************************************/
#ifndef __STRUCTDEF_H__
#define __STRUCTDEF_H__


typedef struct _DNION_TRANSFER_HEADER
{
	int			nMsgLen;					//消息总长度
	int			nMsgCommand;				//消息命令号
	int			nErrorCode;					//消息错误码
	_DNION_TRANSFER_HEADER()
	{
		nMsgLen = 0;
		nMsgCommand = 0;
		nErrorCode = 0;
	};
}DNION_TRANSFER_HEADER;
//===============================================================//
//4 BYTES || 消息总长度
//4 BYTES || 消息命令  ADD DELETE | ADD RESPONSE DELETE RESPONSE 
//4 BYTES || 消息错误码
//===============================================================
//XML -----------------------------------------------------------
//===============================================================

//===============================================================
//DATA ----------------------------------------------------------
//===============================================================//





#endif //__STRUCTDEF_H__


